{
  "main": {
    "name": "Un-quo",
    "occupation": "Building UNQUO",
    "description": "Driving process-driven solutions",    
    "image": "./portfolio/profilepic.png",
    "contactmessage": "Get in touch with me!",
    "email": "cgandhi@unquo.in",
    "phone": "",
    "address": {
      "street": "",
      "city": "",
      "state": "",
      "zip": ""
    },
    "website": "",
    "resumedownload": "./documents/Chintan_Gandhi_CV.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/chintan-gandhi-002774a",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/chints87",
        "className": "fa fa-github"
      }
    ],
    "sections": [
      {
        "id":"1",
        "image": "/images/section/sketch.jpg",
        "title": "sketch",
        "description": "Sketching enables one to contextualize problems from a 20,000 feet view to minutiae details. It helps to gain perspectives over a broader scope to seek effective solutions. Over here, I understand business problems through inquiry and sketching its various components. This entails identifying and nurturing ideas; and then converging on a central concept and build further."
      },
      {
        "id":"2",
        "image": "/images/section/design.png",
        "title": "design",
        "description": "The sketching phase helps to map out prototypes. As details are etched out for user flow, new insights come into the fore that restrict user decision-making to achieve objectives. These are resolved in this phase."
      },
      {
        "id":"3",
        "image": "/images/section/build.png",
        "title": "build",
        "description": "I use ReactJS and NextJS to design the front-end. I focus on fuctionality to achieve user objective before implementing visual design elements. At the end of this, I hand you a fully functional front-end with APIs that is optimized for web performance."
        
      }
    ],  
    "resume": {
      "skillmessage": "",
      "education": [
        {
          "school": "",
          "degree": "",
          "graduated": "",
          "description": ""
        }
      ],
      "work": [
        {
          "company": "",
          "title": "",
          "years": "",
          "description": ""
        }
      ],
      "techSkills": [
        {
          "name": "HTML",
          "level": "100%"
        },
        {
          "name": "CSS",
          "level": "100%"
        },     
        {
          "name": "SASS",
          "level": "99%"
        },
        {
          "name": "ReactJS",
          "level": "100%"
        },
        {
          "name": "NextJS",
          "level": "100%"
        },
        {
          "name": "JavaScript",
          "level": "99%"
        },
        {
          "name": "Strapi",
          "level": "100%"
        },
        {
          "name": "Firebase",
          "level": "100%"
        },
        {
          "name": "Git",
          "level": "70%"
        },
        {
          "name": "Python",
          "level": "85%"
        }      
      ],
      "softSkills": [
          {
            "name": "Creativity",
            "level": "100%"
          },
          {
            "name": "Empathy",
            "level": "100%"
          },     
          {
            "name": "Problem Solving",
            "level": "99%"
          }      
        ]
      },
    "portfolio": {
      "liveProjects": [
        {
          "title": "HandForHandmade",
          "description": "Designed concepts, UI and Front-End for a pan-India discovery platform which brings artisans, designers and various organizations to enable business collaborations to sustain artisan livelihood  ",
          "category": "",
          "image": "handforhandmade.png",
          "url": "https://www.handforhandmade.org/",
          "section" : [
            { "subheader" : "Created constraints for focus and creativity",
              "description" : "After an initial discussion, a rough layout was sketched out and a low-fidelity prototype was developed for user flows on Figma, a sketching tool. Visuals and low details provided context for brainstorming; and being critical of adding features."
            },
            { "subheader" :"Provided color schemes", 
              "description" : "The color schemes were developed based on the logo color and its contrast colors with various hues.  The different hues of the logo and contrast colors were combined and shown to the client to choose from."
            },
            { "subheader" :"Differentiate experiences", 
              "description" : "The app would have a regular site visitor; a registered user; and a member user. For each user category - unless a member user, information access restrictions were placed."
              
            },
            { "subheader" :"Information gathering", 
              "description" : "The members were categorized as individuals and non-individuals. In addition, there were numerous classifications within these categories. For each classification, information requirements varied and accordingly forms were programmed to capture the required data."
            },
            { "subheader" :"Empathize with users", 
              "description" : "Given this app needs to support people living in rural areas, where they are resource constrained. Images with high-resolution are data heavy that could consume all their data. In order to empathize with such users white sending or receiving data, images uploads were compressed to about 90% of their original size while maintaining quality."
            },
            { "subheader" :"Offline payments", 
              "description" : "When a payment gateway could not be implemented due to certain challenges, a plan B was quickly devised and implemented. The app streamlined to complement the offline payment process."
            }
          ],
          "tools" : [
            "Figma", "React", "Redux", "Axios", "Formik", "Material UI"
          ]
        }       
      ],
      "demoProjects": [

        {
          "title": "NetflixClone",
          "description": "Developed a responsive app using ReactJS, Google Firebase and Stripe payment gateway",
          "category": "",
          "image": "netflixclone.png",
          "githubLink": "https://github.com/chints87/netflix-clone",
          "url": "https://netflix-clone-fe5ad.web.app/",
          "section" : [
            { "subheader" : "Component design and development",
              "description" : "Understood data flow to design application architecture, which is an iterative process, with reusable components.In addition, SASS was integreated to make efficient design changes for components"
            },                     
            { "subheader" :"Implemented NoSQL database using Google Firestore and Stripe payments integration", 
              "description" : "On a user signing up, their data was stored on a firestore database. The products, pricing and subscriptions plans served to the user were developed on Stripe. A webhook was implemented, that synchronized changes to firestore from Stripe, when a user subscribed to a product and made payment in Stripe. As a result, all latest information regarding a user's subscription were availabe at one place i.e. firestore database."
            },
            { "subheader" : "Researched and implemented APIs",
              "description" : "In order to fetch movie data and facilitate payments, the movieDB and Stripe API were used."
            }  
            
          ],
          "tools" : [
            "React", "Redux Toolkit", "SASS", "Firebase", "Axios", "Stripe Payments"
          ]
        }
        
      ]
    },
    "testimonials": {
      "testimonials": [
        {
          "text": "",
          "user": ""
        },
        {
          "text": "",
          "user": ""
        }
      ]
    }
  }
}




